Revit 2026 API

# RebarFreeFormAccessorAddUpdatingSharedParameter Method

---

Add existing shared parameter as a dependency for the calculation of the rebar curves.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddUpdatingSharedParameter(
	ElementId parameterId
)
```
```vb
Public Sub AddUpdatingSharedParameter (
	parameterId As ElementId
)
```
```cpp
public:
void AddUpdatingSharedParameter(
	ElementId^ parameterId
)
```
```fsharp
member AddUpdatingSharedParameter :
        parameterId : ElementId -> unit
```

#### Parameters

parameterId ElementId
     ElementId of the shared parameter to be added.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. -or- parameterId is a parameter that is not bound to the Rebar element category. |

The input parameter needs to be bound to the Rebar element

The rebar element needs to have a valid external server

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace